SpanPhase2/Main/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
93438
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    Surface
    {
        type            empty;
    }
    workpiece
    {
        type            zeroGradient;
    }
    tool
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    outlet_side_1
    {
        type            empty;
    }
    outlet_side_2
    {
        type            empty;
    }
    outlet_side_3
    {
        type            empty;
    }
    outlet_side_4
    {
        type            empty;
    }
    outlet_side_5
    {
        type            empty;
    }
    outlet_side_6
    {
        type            empty;
    }
    outlet_side_7
    {
        type            empty;
    }
    outlet_side_8
    {
        type            empty;
    }
    outlet_empty
    {
        type            zeroGradient;
    }
    outlet_wall
    {
        type            zeroGradient;
    }
    outlet_ext
    {
        type            zeroGradient;
    }
    back_oversetMesh
    {
        type            empty;
    }
    arcStart34
    {
        type            zeroGradient;
    }
    arc4_1
    {
        type            overset;
        value           uniform 1;
    }
    arc4_2
    {
        type            overset;
        value           uniform 1;
    }
    arc4_3
    {
        type            overset;
        value           uniform 1;
    }
    arc4_4
    {
        type            overset;
        value           uniform 1;
    }
    arc4_5
    {
        type            overset;
        value           uniform 1;
    }
    arc4_6
    {
        type            overset;
        value           uniform 1;
    }
    arc4_7
    {
        type            overset;
        value           uniform 1;
    }
    arc4_8
    {
        type            overset;
        value           uniform 1;
    }
    arc4_9
    {
        type            overset;
        value           uniform 1;
    }
    arc4_10
    {
        type            overset;
        value           uniform 1;
    }
    arc4_11
    {
        type            overset;
        value           uniform 1;
    }
    arc4_12
    {
        type            overset;
        value           uniform 1;
    }
    arc4_13
    {
        type            overset;
        value           uniform 1;
    }
    arc4_14
    {
        type            overset;
        value           uniform 1;
    }
    arc4_15
    {
        type            overset;
        value           uniform 1;
    }
    arc4_16
    {
        type            overset;
        value           uniform 1;
    }
    arc4_17
    {
        type            overset;
        value           uniform 1;
    }
    arc4_18
    {
        type            overset;
        value           uniform 1;
    }
    arc4_19
    {
        type            overset;
        value           uniform 1;
    }
    arc4_20
    {
        type            overset;
        value           uniform 1;
    }
    arc4_21
    {
        type            overset;
        value           uniform 1;
    }
    arc4_22
    {
        type            overset;
        value           uniform 1;
    }
    arc4_23
    {
        type            overset;
        value           uniform 1;
    }
    arc4_24
    {
        type            overset;
        value           uniform 1;
    }
    arc4_25
    {
        type            overset;
        value           uniform 1;
    }
    arc4_26
    {
        type            overset;
        value           uniform 1;
    }
    arc4_27
    {
        type            overset;
        value           uniform 1;
    }
    arc4_28
    {
        type            overset;
        value           uniform 1;
    }
    arc4_29
    {
        type            overset;
        value           uniform 1;
    }
    arc4_30
    {
        type            overset;
        value           uniform 1;
    }
    arc4_31
    {
        type            overset;
        value           uniform 1;
    }
    arc4_32
    {
        type            overset;
        value           uniform 1;
    }
    arc4_33
    {
        type            overset;
        value           uniform 1;
    }
    arc4_34
    {
        type            overset;
        value           uniform 1;
    }
    arc4_35
    {
        type            overset;
        value           uniform 1;
    }
    arc4_36
    {
        type            overset;
        value           uniform 1;
    }
    arc4_37
    {
        type            overset;
        value           uniform 1;
    }
    arc4_38
    {
        type            overset;
        value           uniform 1;
    }
    arc4_39
    {
        type            overset;
        value           uniform 1;
    }
    arc4_40
    {
        type            overset;
        value           uniform 1;
    }
    arc4_41
    {
        type            overset;
        value           uniform 1;
    }
    arc4_42
    {
        type            overset;
        value           uniform 1;
    }
    arc4_43
    {
        type            overset;
        value           uniform 1;
    }
    arc4_44
    {
        type            overset;
        value           uniform 1;
    }
    arc4_45
    {
        type            overset;
        value           uniform 1;
    }
    arc4_46
    {
        type            overset;
        value           uniform 1;
    }
    arc4_47
    {
        type            overset;
        value           uniform 1;
    }
    arc4_48
    {
        type            overset;
        value           uniform 1;
    }
    arc4_49
    {
        type            overset;
        value           uniform 1;
    }
    arc4_50
    {
        type            overset;
        value           uniform 1;
    }
    arcEnd34
    {
        type            zeroGradient;
    }
    arc3_50
    {
        type            zeroGradient;
    }
    arc3_49
    {
        type            zeroGradient;
    }
    arc3_48
    {
        type            zeroGradient;
    }
    arc3_47
    {
        type            zeroGradient;
    }
    arc3_46
    {
        type            zeroGradient;
    }
    arc3_45
    {
        type            zeroGradient;
    }
    arc3_44
    {
        type            zeroGradient;
    }
    arc3_43
    {
        type            zeroGradient;
    }
    arc3_42
    {
        type            zeroGradient;
    }
    arc3_41
    {
        type            zeroGradient;
    }
    arc3_40
    {
        type            zeroGradient;
    }
    arc3_39
    {
        type            zeroGradient;
    }
    arc3_38
    {
        type            zeroGradient;
    }
    arc3_37
    {
        type            zeroGradient;
    }
    arc3_36
    {
        type            zeroGradient;
    }
    arc3_35
    {
        type            zeroGradient;
    }
    arc3_34
    {
        type            zeroGradient;
    }
    arc3_33
    {
        type            zeroGradient;
    }
    arc3_32
    {
        type            zeroGradient;
    }
    arc3_31
    {
        type            zeroGradient;
    }
    arc3_30
    {
        type            zeroGradient;
    }
    arc3_29
    {
        type            zeroGradient;
    }
    arc3_28
    {
        type            zeroGradient;
    }
    arc3_27
    {
        type            zeroGradient;
    }
    arc3_26
    {
        type            zeroGradient;
    }
    arc3_25
    {
        type            zeroGradient;
    }
    arc3_24
    {
        type            zeroGradient;
    }
    arc3_23
    {
        type            zeroGradient;
    }
    arc3_22
    {
        type            zeroGradient;
    }
    arc3_21
    {
        type            zeroGradient;
    }
    arc3_20
    {
        type            zeroGradient;
    }
    arc3_19
    {
        type            zeroGradient;
    }
    arc3_18
    {
        type            zeroGradient;
    }
    arc3_17
    {
        type            zeroGradient;
    }
    arc3_16
    {
        type            zeroGradient;
    }
    arc3_15
    {
        type            zeroGradient;
    }
    arc3_14
    {
        type            zeroGradient;
    }
    arc3_13
    {
        type            zeroGradient;
    }
    arc3_12
    {
        type            zeroGradient;
    }
    arc3_11
    {
        type            zeroGradient;
    }
    arc3_10
    {
        type            zeroGradient;
    }
    arc3_9
    {
        type            zeroGradient;
    }
    arc3_8
    {
        type            zeroGradient;
    }
    arc3_7
    {
        type            zeroGradient;
    }
    arc3_6
    {
        type            zeroGradient;
    }
    arc3_5
    {
        type            zeroGradient;
    }
    arc3_4
    {
        type            zeroGradient;
    }
    arc3_3
    {
        type            zeroGradient;
    }
    arc3_2
    {
        type            zeroGradient;
    }
    arc3_1
    {
        type            zeroGradient;
    }
    front_oversetMesh
    {
        type            zeroGradient;
    }
    arcStart12
    {
        type            zeroGradient;
    }
    arc2_1
    {
        type            zeroGradient;
    }
    arc2_2
    {
        type            zeroGradient;
    }
    arc2_3
    {
        type            zeroGradient;
    }
    arc2_4
    {
        type            zeroGradient;
    }
    arc2_5
    {
        type            zeroGradient;
    }
    arc2_6
    {
        type            zeroGradient;
    }
    arc2_7
    {
        type            zeroGradient;
    }
    arc2_8
    {
        type            zeroGradient;
    }
    arc2_9
    {
        type            zeroGradient;
    }
    arc2_10
    {
        type            zeroGradient;
    }
    arc2_11
    {
        type            zeroGradient;
    }
    arc2_12
    {
        type            zeroGradient;
    }
    arc2_13
    {
        type            zeroGradient;
    }
    arc2_14
    {
        type            zeroGradient;
    }
    arc2_15
    {
        type            zeroGradient;
    }
    arc2_16
    {
        type            zeroGradient;
    }
    arc2_17
    {
        type            zeroGradient;
    }
    arc2_18
    {
        type            zeroGradient;
    }
    arc2_19
    {
        type            zeroGradient;
    }
    arc2_20
    {
        type            zeroGradient;
    }
    arc2_21
    {
        type            zeroGradient;
    }
    arc2_22
    {
        type            zeroGradient;
    }
    arc2_23
    {
        type            zeroGradient;
    }
    arc2_24
    {
        type            zeroGradient;
    }
    arc2_25
    {
        type            zeroGradient;
    }
    arc2_26
    {
        type            zeroGradient;
    }
    arc2_27
    {
        type            zeroGradient;
    }
    arc2_28
    {
        type            zeroGradient;
    }
    arc2_29
    {
        type            zeroGradient;
    }
    arc2_30
    {
        type            zeroGradient;
    }
    arc2_31
    {
        type            zeroGradient;
    }
    arc2_32
    {
        type            zeroGradient;
    }
    arc2_33
    {
        type            zeroGradient;
    }
    arc2_34
    {
        type            zeroGradient;
    }
    arc2_35
    {
        type            zeroGradient;
    }
    arc2_36
    {
        type            zeroGradient;
    }
    arc2_37
    {
        type            zeroGradient;
    }
    arc2_38
    {
        type            zeroGradient;
    }
    arc2_39
    {
        type            zeroGradient;
    }
    arc2_40
    {
        type            zeroGradient;
    }
    arc2_41
    {
        type            zeroGradient;
    }
    arc2_42
    {
        type            zeroGradient;
    }
    arc2_43
    {
        type            zeroGradient;
    }
    arc2_44
    {
        type            zeroGradient;
    }
    arc2_45
    {
        type            zeroGradient;
    }
    arc2_46
    {
        type            zeroGradient;
    }
    arc2_47
    {
        type            zeroGradient;
    }
    arc2_48
    {
        type            zeroGradient;
    }
    arc2_49
    {
        type            zeroGradient;
    }
    arc2_50
    {
        type            zeroGradient;
    }
    arcEnd12
    {
        type            zeroGradient;
    }
    arc1_49
    {
        type            overset;
        value           uniform 1;
    }
    arc1_48
    {
        type            overset;
        value           uniform 1;
    }
    arc1_47
    {
        type            overset;
        value           uniform 1;
    }
    arc1_46
    {
        type            overset;
        value           uniform 1;
    }
    arc1_45
    {
        type            overset;
        value           uniform 1;
    }
    arc1_44
    {
        type            overset;
        value           uniform 1;
    }
    arc1_43
    {
        type            overset;
        value           uniform 1;
    }
    arc1_42
    {
        type            overset;
        value           uniform 1;
    }
    arc1_41
    {
        type            overset;
        value           uniform 1;
    }
    arc1_40
    {
        type            overset;
        value           uniform 1;
    }
    arc1_39
    {
        type            overset;
        value           uniform 1;
    }
    arc1_38
    {
        type            overset;
        value           uniform 1;
    }
    arc1_37
    {
        type            overset;
        value           uniform 1;
    }
    arc1_36
    {
        type            overset;
        value           uniform 1;
    }
    arc1_35
    {
        type            overset;
        value           uniform 1;
    }
    arc1_34
    {
        type            overset;
        value           uniform 1;
    }
    arc1_33
    {
        type            overset;
        value           uniform 1;
    }
    arc1_32
    {
        type            overset;
        value           uniform 1;
    }
    arc1_31
    {
        type            overset;
        value           uniform 1;
    }
    arc1_30
    {
        type            overset;
        value           uniform 1;
    }
    arc1_29
    {
        type            overset;
        value           uniform 1;
    }
    arc1_28
    {
        type            overset;
        value           uniform 1;
    }
    arc1_27
    {
        type            overset;
        value           uniform 1;
    }
    arc1_26
    {
        type            overset;
        value           uniform 1;
    }
    arc1_25
    {
        type            overset;
        value           uniform 1;
    }
    arc1_24
    {
        type            overset;
        value           uniform 1;
    }
    arc1_23
    {
        type            overset;
        value           uniform 1;
    }
    arc1_22
    {
        type            overset;
        value           uniform 1;
    }
    arc1_21
    {
        type            overset;
        value           uniform 1;
    }
    arc1_20
    {
        type            overset;
        value           uniform 1;
    }
    arc1_19
    {
        type            overset;
        value           uniform 1;
    }
    arc1_18
    {
        type            overset;
        value           uniform 1;
    }
    arc1_17
    {
        type            overset;
        value           uniform 1;
    }
    arc1_16
    {
        type            overset;
        value           uniform 1;
    }
    arc1_15
    {
        type            overset;
        value           uniform 1;
    }
    arc1_14
    {
        type            overset;
        value           uniform 1;
    }
    arc1_13
    {
        type            overset;
        value           uniform 1;
    }
    arc1_12
    {
        type            overset;
        value           uniform 1;
    }
    arc1_11
    {
        type            overset;
        value           uniform 1;
    }
    arc1_10
    {
        type            overset;
        value           uniform 1;
    }
    arc1_9
    {
        type            overset;
        value           uniform 1;
    }
    arc1_8
    {
        type            overset;
        value           uniform 1;
    }
    arc1_7
    {
        type            overset;
        value           uniform 1;
    }
    arc1_6
    {
        type            overset;
        value           uniform 1;
    }
    arc1_5
    {
        type            overset;
        value           uniform 1;
    }
    arc1_4
    {
        type            overset;
        value           uniform 1;
    }
    arc1_3
    {
        type            overset;
        value           uniform 1;
    }
    arc1_2
    {
        type            overset;
        value           uniform 1;
    }
    arc1_1
    {
        type            overset;
        value           uniform 1;
    }
}


// ************************************************************************* //
