SpanPhase2/Main/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 arch "LSB;label=32;scalar=64";
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  back

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 2964;
    startFace 257629;

  }
  Surface

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 260593;

  }
  workpiece

  {
    type wall;
    physicalType patch;
    inGroups
      (
        wall
      );
    nFaces 1596;
    startFace 260593;

  }
  tool

  {
    type wall;
    physicalType patch;
    inGroups
      (
        wall
      );
    nFaces 234;
    startFace 262189;

  }
  wall

  {
    type wall;
    physicalType patch;
    inGroups
      (
        wall
      );
    nFaces 1066;
    startFace 262423;

  }
  inlet

  {
    type patch;
    physicalType patch;
    nFaces 78;
    startFace 263489;

  }
  outlet

  {
    type wall;
    physicalType patch;
    inGroups
      (
        wall
      );
    nFaces 169;
    startFace 263567;

  }
  front

  {
    type wall;
    physicalType patch;
    inGroups
      (
        wall
      );
    nFaces 2964;
    startFace 263736;

  }
  outlet_side_1

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_2

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_3

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_4

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_5

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_6

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_7

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_side_8

  {
    type empty;
    physicalType patch;
    inGroups
      (
        empty
      );
    nFaces 0;
    startFace 266700;

  }
  outlet_empty

  {
    type slip;
    physicalType patch;
    inGroups
      (
        slip
      );
    nFaces 3111;
    startFace 266700;

  }
  outlet_wall

  {
    type slip;
    physicalType patch;
    inGroups
      (
        slip
      );
    nFaces 2023;
    startFace 269811;

  }
  outlet_ext

  {
    type patch;
    physicalType patch;
    nFaces 952;
    startFace 271834;

  }
  back_oversetMesh

  {
    type empty;
    physicalType patch;
    nFaces 395;
    startFace 272786;

  }
  arcStart34

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 273181;

  }
  arc4_1

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273219;

  }
  arc4_2

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273257;

  }
  arc4_3

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273295;

  }
  arc4_4

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273333;

  }
  arc4_5

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273371;

  }
  arc4_6

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273409;

  }
  arc4_7

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273447;

  }
  arc4_8

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273485;

  }
  arc4_9

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273523;

  }
  arc4_10

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273561;

  }
  arc4_11

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273599;

  }
  arc4_12

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273637;

  }
  arc4_13

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273675;

  }
  arc4_14

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273713;

  }
  arc4_15

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273751;

  }
  arc4_16

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273789;

  }
  arc4_17

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273827;

  }
  arc4_18

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273865;

  }
  arc4_19

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273903;

  }
  arc4_20

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273941;

  }
  arc4_21

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 273979;

  }
  arc4_22

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274017;

  }
  arc4_23

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274055;

  }
  arc4_24

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274093;

  }
  arc4_25

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274131;

  }
  arc4_26

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274169;

  }
  arc4_27

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274207;

  }
  arc4_28

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274245;

  }
  arc4_29

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274283;

  }
  arc4_30

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274321;

  }
  arc4_31

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274359;

  }
  arc4_32

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274397;

  }
  arc4_33

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274435;

  }
  arc4_34

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274473;

  }
  arc4_35

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274511;

  }
  arc4_36

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274549;

  }
  arc4_37

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274587;

  }
  arc4_38

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274625;

  }
  arc4_39

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274663;

  }
  arc4_40

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274701;

  }
  arc4_41

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274739;

  }
  arc4_42

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274777;

  }
  arc4_43

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274815;

  }
  arc4_44

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274853;

  }
  arc4_45

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274891;

  }
  arc4_46

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274929;

  }
  arc4_47

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 274967;

  }
  arc4_48

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 275005;

  }
  arc4_49

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 275043;

  }
  arc4_50

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 275081;

  }
  arcEnd34

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275119;

  }
  arc3_50

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275157;

  }
  arc3_49

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275195;

  }
  arc3_48

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275233;

  }
  arc3_47

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275271;

  }
  arc3_46

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275309;

  }
  arc3_45

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275347;

  }
  arc3_44

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275385;

  }
  arc3_43

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275423;

  }
  arc3_42

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275461;

  }
  arc3_41

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275499;

  }
  arc3_40

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275537;

  }
  arc3_39

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275575;

  }
  arc3_38

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275613;

  }
  arc3_37

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275651;

  }
  arc3_36

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275689;

  }
  arc3_35

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275727;

  }
  arc3_34

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275765;

  }
  arc3_33

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275803;

  }
  arc3_32

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275841;

  }
  arc3_31

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275879;

  }
  arc3_30

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275917;

  }
  arc3_29

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275955;

  }
  arc3_28

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 275993;

  }
  arc3_27

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276031;

  }
  arc3_26

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276069;

  }
  arc3_25

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276107;

  }
  arc3_24

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276145;

  }
  arc3_23

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276183;

  }
  arc3_22

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276221;

  }
  arc3_21

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276259;

  }
  arc3_20

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276297;

  }
  arc3_19

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276335;

  }
  arc3_18

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276373;

  }
  arc3_17

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276411;

  }
  arc3_16

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276449;

  }
  arc3_15

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276487;

  }
  arc3_14

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276525;

  }
  arc3_13

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276563;

  }
  arc3_12

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276601;

  }
  arc3_11

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276639;

  }
  arc3_10

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276677;

  }
  arc3_9

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276715;

  }
  arc3_8

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276753;

  }
  arc3_7

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276791;

  }
  arc3_6

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276829;

  }
  arc3_5

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276867;

  }
  arc3_4

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276905;

  }
  arc3_3

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276943;

  }
  arc3_2

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 276981;

  }
  arc3_1

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277019;

  }
  front_oversetMesh

  {
    type wall;
    physicalType patch;
    nFaces 395;
    startFace 277057;

  }
  arcStart12

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277452;

  }
  arc2_1

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277490;

  }
  arc2_2

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277528;

  }
  arc2_3

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277566;

  }
  arc2_4

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277604;

  }
  arc2_5

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277642;

  }
  arc2_6

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277680;

  }
  arc2_7

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277718;

  }
  arc2_8

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277756;

  }
  arc2_9

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277794;

  }
  arc2_10

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277832;

  }
  arc2_11

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277870;

  }
  arc2_12

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277908;

  }
  arc2_13

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277946;

  }
  arc2_14

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 277984;

  }
  arc2_15

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278022;

  }
  arc2_16

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278060;

  }
  arc2_17

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278098;

  }
  arc2_18

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278136;

  }
  arc2_19

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278174;

  }
  arc2_20

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278212;

  }
  arc2_21

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278250;

  }
  arc2_22

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278288;

  }
  arc2_23

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278326;

  }
  arc2_24

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278364;

  }
  arc2_25

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278402;

  }
  arc2_26

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278440;

  }
  arc2_27

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278478;

  }
  arc2_28

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278516;

  }
  arc2_29

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278554;

  }
  arc2_30

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278592;

  }
  arc2_31

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278630;

  }
  arc2_32

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278668;

  }
  arc2_33

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278706;

  }
  arc2_34

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278744;

  }
  arc2_35

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278782;

  }
  arc2_36

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278820;

  }
  arc2_37

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278858;

  }
  arc2_38

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278896;

  }
  arc2_39

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278934;

  }
  arc2_40

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 278972;

  }
  arc2_41

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279010;

  }
  arc2_42

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279048;

  }
  arc2_43

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279086;

  }
  arc2_44

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279124;

  }
  arc2_45

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279162;

  }
  arc2_46

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279200;

  }
  arc2_47

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279238;

  }
  arc2_48

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279276;

  }
  arc2_49

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279314;

  }
  arc2_50

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279352;

  }
  arcEnd12

  {
    type wall;
    physicalType patch;
    nFaces 38;
    startFace 279390;

  }
  arc1_49

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279428;

  }
  arc1_48

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279466;

  }
  arc1_47

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279504;

  }
  arc1_46

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279542;

  }
  arc1_45

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279580;

  }
  arc1_44

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279618;

  }
  arc1_43

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279656;

  }
  arc1_42

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279694;

  }
  arc1_41

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279732;

  }
  arc1_40

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279770;

  }
  arc1_39

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279808;

  }
  arc1_38

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279846;

  }
  arc1_37

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279884;

  }
  arc1_36

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279922;

  }
  arc1_35

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279960;

  }
  arc1_34

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 279998;

  }
  arc1_33

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280036;

  }
  arc1_32

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280074;

  }
  arc1_31

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280112;

  }
  arc1_30

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280150;

  }
  arc1_29

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280188;

  }
  arc1_28

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280226;

  }
  arc1_27

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280264;

  }
  arc1_26

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280302;

  }
  arc1_25

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280340;

  }
  arc1_24

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280378;

  }
  arc1_23

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280416;

  }
  arc1_22

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280454;

  }
  arc1_21

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280492;

  }
  arc1_20

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280530;

  }
  arc1_19

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280568;

  }
  arc1_18

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280606;

  }
  arc1_17

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280644;

  }
  arc1_16

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280682;

  }
  arc1_15

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280720;

  }
  arc1_14

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280758;

  }
  arc1_13

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280796;

  }
  arc1_12

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280834;

  }
  arc1_11

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280872;

  }
  arc1_10

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280910;

  }
  arc1_9

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280948;

  }
  arc1_8

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 280986;

  }
  arc1_7

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281024;

  }
  arc1_6

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281062;

  }
  arc1_5

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281100;

  }
  arc1_4

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281138;

  }
  arc1_3

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281176;

  }
  arc1_2

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281214;

  }
  arc1_1

  {
    type overset;
    physicalType patch;
    nFaces 38;
    startFace 281252;

  }
)


// ************************************************************************* //
